/*************************************************************************
	> File Name: pai0.c
	> Author: 
	> Mail: 
	> Created Time: 2018年12月10日 星期一 08时42分36秒
 ************************************************************************/

#include<stdio.h>
int main(){
    int i; // 控制100次连乘的循环
    float pai=4; // π的定义, 浮点数
    printf("以下的程序我们将会计算π的数值,请稍候!\n");
    for(i=1; i<=101; i++ ){
        pai = pai * 4 * i * (i + 1) / (2 * i + 1) / (2 * i + 1); 
//            pai = pai * 2 * i * 2 * ( i + 1 );
//            pai = pai / (2 * i + 1) /( 2 * i + 1 );
    }
    printf("π的计算数值为:%.7f\n", pai);
    return 0;
}
